#L'url des images est relative a l'emplacement de la page en cours. 
#<img src="../../../resources/../../../resources/images/icones/nomImage.png"> 

emploi.constituer=<h1>Constituer un emploi du temps</h1>(vid&eacute;os explicatives en bas de cette page)<p><span style="font-weight:bold; vertical-align: bottom;">Saisie ou modification de l'emploi du temps</span></p><p>Les emplois du temps peuvent avoir &eacute;t&eacute; import&eacute;s par l'administrateur du cahier de texte et dans ce cas vous pouvez v&eacute;rifier et si besoin, compl&eacute;ter votre emploi du temps. Ils peuvent &eacute;galement ne pas avoir &eacute;t&eacute; import&eacute;s et vous devez alors commencer l'utilisation du cahier de texte par la saisie de votre emploi du temps.</p> Chaque enseignant cr&eacute;e ou modifie son emploi du temps &agrave; l’aide d'un agenda. Si l'&eacute;tablissement a d&eacute;fini une alternance des semaines 1 et 2, celles ci sont accessibles via les onglets "<span style="font-weight:italic; vertical-align: bottom;">Semaine 1</span>" et "<span style="font-weight:italic; vertical-align: bottom;">Semaine 2</span>".<br/>Le menu contextuel (espace <span style="font-weight:italic; vertical-align: bottom;">Actions</span>) de la saisie d'emploi du temps propose les boutons suivants :<br/><div style="margin-left: 40px;"><img style="width: 20px; vertical-align: baseline;" title="Enregistrer" alt="Enregistrer" src="../../../resources/images/aide/Enregistrer.png"> : enregistrer l'emploi du temps courant ;<br/><img style="width: 20px; vertical-align: baseline;" title="Supprimer" alt="Supprimer" src="../../../resources/images/aide/supprimer.png"> : supprimer l'emploi du temps courant ;<br/><img style="width: 20px; vertical-align: baseline;" title="nouvel emploi du temps" alt="nouvel emploi du temps" src="../../../resources/images/aide/Nouvel_Edt.png"> : cr&eacute;er un nouvel emploi du temps, &agrave; partir d'une date donn&eacute;e ;<br/><img style="width: 20px; vertical-align: baseline;" title="Dupliquer semaine 1 vers semaine 2" alt="Dupliquer semaine 1 vers semaine 2" src="../../../resources/images/aide/Dupliquer_S1_S2.png"> : dupliquer la semaine 1 sur la semaine 2 ;<br/><img style="width: 20px; vertical-align: baseline;" title="PDF" alt="PDF" src="../../../resources/images/aide/Pdf.png"> : &eacute;dition de l'emploi du temps au format PDF ;<br/><img style="width: 20px; vertical-align: baseline;" title="Aide en ligne" alt="Aide en ligne" src="../../../resources/images/aide/Aide.png"> : aide en ligne de la saisie de l'emploi du temps.<br/></div><p>La grille horaire de l'&eacute;tablissement est rappel&eacute;e &agrave; gauche de l'&eacute;cran et sert de rep&egrave;re visuel pour saisir les cases horaires.</p><p><img style="width: 100%; border: 1px solid;" title="Grille de saisie de l'emploi du temps" alt="Grille de saisie de l'emploi du temps" src="../../../resources/images/aide/Grille_edt.png"></p><p></p><p>Pour ajouter une case horaire, il suffit de cliquer dans l’agenda au jour et &agrave; la tranche horaire d&eacute;sir&eacute;e. La case se cale automatiquement sur la grille horaire et une fen&ecirc;tre permet de pr&eacute;ciser les &eacute;l&eacute;ments de cette case horaire : les heures de d&eacute;but et de fin &agrave; la minute pr&egrave;s, l'enseignement dispens&eacute;, la classe ou le groupe, et de fa&ccedil;on optionnelle une description, une salle et une couleur qui sera utilis&eacute;e dans les diff&eacute;rents &eacute;crans du cahier de texte :<br/></p><p><img style="border:1px solid;" title="D&eacute;tail d'une case horaire de l'emploi du temps" alt="D&eacute;tail d'une case horaire de l'emploi du temps" src="../../../resources/images/aide/Case_horaire.png"></p><p></p><p>Il est possible d&eacute;placer une case horaire d&eacute;j&agrave; cr&eacute;&eacute;e par glisser-d&eacute;placer. Le d&eacute;placement est contr&ocirc;l&eacute; par la grille horaire de l'&eacute;tablissement.</p><p>Il est &eacute;galement possible de changer l’heure de fin d’une case en agrandissant ou en diminuant la case directement dans la grille. L’heure de fin est contr&ocirc;l&eacute;e par la grille horaire et le param&eacute;trage &eacute;tablissement d&eacute;fini pour la scission.</p><p>En cliquant sur une case horaire d&eacute;j&agrave; d&eacute;finie, on peut modifier les &eacute;l&eacute;ments constitutifs de cette case comme lors de sa cr&eacute;ation.</p><p></p><p>Pour supprimer une case horaire, il suffit de cliquer dans  l’agenda sur la case horaire et de valider la suppression avec le bouton <img style="width: 20px; vertical-align: baseline;" title="Supprimer" alt="Supprimer" src="../../../resources/images/aide/supprimer.png">.</p><p></p><span style="font-weight:bold; vertical-align: bottom;">Semaines 1 et 2</span><p></p><p>Si le param&eacute;trage de l’&eacute;tablissement le pr&eacute;voit, l’emploi du temps peut &ecirc;tre diff&eacute;rent entre la semaine 1 et la semaine 2.</p><p>Afin de faciliter la saisie, il est possible de copier l’emploi du temps de la semaine 1 vers la semaine 2 en utilisant le bouton <img style="width: 20px; vertical-align: baseline;" title="Dupliquer semaine 1 vers semaine 2"  alt="Dupliquer semaine 1 vers semaine 2" src="../../../resources/images/aide/Dupliquer_S1_S2.png"> de l'espace <span style="font-weight:italic; vertical-align: bottom;">Actions</span>.<br/></p><p><img style="border: 1px solid;" title="Duplication semaine 1 vers semaine 2" alt="Duplication semaine 1 vers semaine 2" src="../../../resources/images/aide/DuplicationS1VersS2.png"><br/></p><p></p><p>L’enregistrement complet de l’emploi du temps est effectu&eacute; avec le bouton <img style="width: 20px; vertical-align: baseline;" title="Enregistrer" alt="Enregistrer" src="../../../resources/images/aide/Enregistrer.png"> de l’espace <span style="font-weight:italic; vertical-align: bottom;">Actions</span>.</p><p>Il est possible de supprimer la totalit&eacute; d’un emploi du temps avec le bouton <img style="width: 20px; vertical-align: baseline;" title="Supprimer" alt="Supprimer" src="../../../resources/images/aide/supprimer.png"> et apr&egrave;s confirmation de l’utilisateur.<br/></p><p></p><p><span style="font-weight:bold; vertical-align: bottom;">Des enseignements sur une dur&eacute;e inf&eacute;rieure &agrave; l'ann&eacute;e scolaire</span></p><p>Si un enseignement s'arr&ecirc;te &agrave; une date donn&eacute;e dans l'ann&eacute;e, par exemple l'AP du lundi matin n'existe que jusqu'au 01/03/2013, il est possible de d&eacute;finir plusieurs emplois du temps successifs dans l'ann&eacute;e.</p><p>Il est possible d’ajouter un emploi du temps par clic sur le bouton <img style="width: 20px; vertical-align: baseline;" title="nouvel emploi du temps" alt="nouvel emploi du temps" src="../../../resources/images/aide/Nouvel_Edt.png">.</p><p><img style="border: 1px solid;" title="Cr&eacute;ation nouvel emploi du temps" alt="Cr&eacute;ation nouvel emploi du temps" src="../../../resources/images/aide/CreationNouvelEdt.png"><br/></p><p></p><p></p><p>Un clic sur le bouton <img style="width: 20px; vertical-align: baseline;" title="Enregistrer" alt="Enregistrer" src="../../../resources/images/aide/Enregistrer.png"> permet de cr&eacute;er en base de donn&eacute;es le nouvel emploi du temps et sa p&eacute;riode.</p><p></p><p>A partir de ce moment 2 emplois du temps distincts existent pour l'ann&eacute;e scolaire et il est possible de s&eacute;lectionner l'un ou l'autre des emplois du temps pour les modifier :</p><p><img style="border: 1px solid;" title="Choisir un emploi du temps" alt="Choisir un emploi du temps" src="../../../resources/images/aide/Choisir_EDT.png"></p><p><br/></p><br/><p><span style="font-weight:bold; vertical-align: bottom;">Vidéos de d&eacute;monstration</<pan></p><p>Les deux vid&eacute;os suivantes pr&eacute;sentent en image une saisie d'emploi du temps.</p><p>Constitution de l'emploi du temps, premi&egrave;re partie :<p><p><object type="application/x-mplayer2" style="width: 386px; height: 200px;" data="/documentations/cahier_texte/aide/videos/Edt1.mp4"><param name="Emploi du temps 1" value="/documentations/cahier_texte/aide/videos/Edt1.mp4"/><param name="autoStart" value="1"/><param name="autoplay" value="false"/></object></p><br/><p>Constitution de l'emploi du temps, seconde partie :<p><p><object type="application/x-mplayer2" style="width: 386px; height: 200px;" data="/documentations/cahier_texte/aide/videos/Edt2.mp4"><param name="Emploi du temps 2" value="/documentations/cahier_texte/aide/videos/Edt2.mp4"/><param name="autoStart" value="1"/><param name="autoplay" value="false"/></object></p>

emploi.importer=<h1>Import d'emploi du temps depuis EDT</h1><p>Pour l'import des emplois du temps depuis EDT, deux fichiers XML sont n&eacute;cessaires :<ul><li><span style="font-style:italic;">EDT_vers_STS.xml</span> : issu de EDT, et qui contient les emplois du temp ;</li><li><span style="font-style:italic;">sts_emp.xml</span> : issu de stsWeb, et qui permet de faire le lien entre les donn&eacute;es issues de EDT et celles contenues dans le r&eacute;f&eacute;rentiel de l'ENT (donc celles fournies par l'annuaire f&eacute;d&eacute;rateur acad&eacute;mique).</li></ul>Il est possible d'importer plusieurs emplois du temps sur une m&ecirc;me ann&eacute;e scolaire &agrave; condition que les dates de d&eacute;but soient diff&eacute;rentes.<br/>Il n'y a pas de contr&ocirc;le effectu&eacute avec les saisies individuelles des enseignants ; l'import vient ajouter &agrave; chaque enseignant concern&eacute; une nouvelle p&eacute;riode d'emploi du temps.</p><p>La proc&eacute;dure d'import se d&eacute;roule en deux &eacute;tapes :<div style="margin-left: 40px;"><ul><li>premi&egrave;re &eacute;tape : d&eacute;finition de la date de d&eacute;but de mise en application de l'emploi du temps et t&eacute;l&eacute;chargement les fichiers EDT ;</li><li>deuxi&egrave;me &eacute;tape, plus longue : int&eacute;gration proprement dite de l'ensemble des cases horaires de l'emploi du temps.</li></ul></div><br/><span style="font-weight:bold; vertical-align: bottom;">Premi&egrave;re &eacute;tape</span><p>Cette &eacute;tape consiste &agrave; choisir la date de d&eacute;but de mise en application de l'emploi du temps puis &agrave; t&eacute;l&eacute;charger les fichiers du logiciel EDT.<br/>Les fichiers EDT sont ajout&eacute;s en utilisant le bouton <img style="height: 20px; vertical-align: baseline;" title="Ajouterles ficheirs EDT" alt="Ajouter les fichiers EDT" src="../../../resources/images/aide/AjouterFicEDT.png"/>. Le logiciel place les fichiers dans les bonnes cases du formulaire.<br/>Le formulaire peut &ecirc;tre r&eacute;initialis&eacute; en utilisant le bouton <img style="width: 20px; vertical-align: baseline;" title="R&eacute;initialiser le forulaire" alt="R&eacute;initialiser le formulaire" src="../../../resources/images/aide/Reinitialiser.png"/>.</p><p>Une fois les fichiers ajout&eacute;s, l'import commence en cliquant sur le bouton <img style="width: 20px; vertical-align: baseline;" title="Importer les fichiers EDT" alt="importer les fichiers EDT" src="../../../resources/images/aide/DebutImportEDT.png"/>. Apr&egrave;s confirmation du d&eacute;marrage du traitement, le cahier de texte va v&eacute;rifier la coh&eacute;rence des informations contenues dans les fichiers EDT avec celles du cahier de texte (horaires, classes et groupes, enseignants,...).</p><p>Une fois ce traitement termin&eacute;, un rapport est disponible et accessible via le bouton <img style="width: 20px; vertical-align: baseline;" title="Rapport de l'import des fichiers" alt="Rapport de l'import des fichiers" src="../../../resources/images/aide/Pdf.png"/>. Il pr&eacute;sente le r&eacute;sultat de l'analyse et mentionne les &eacute;ventuelles erreurs rencontr&eacute;es.</p><p>Si le rapport est satisfaisant, la deuxi&egrave;me &eacute;tape peut &ecirc;tre lanc&eacute;e.</p><span style="font-weight:bold; vertical-align: bottom;">Deuxi&egrave;me &eacute;tape</span><p>Cette deuxi&egrave;me &eacute;tape consiste &agrave; ins&eacute;rer les informations EDT dans le cahier de texte. Elle est lanc&eacute;e en utilisant le bouton <img style="width: 20px; vertical-align: baseline;" title="Ins&eacute;rer l'emploi du temps" alt="Ins&eacute;rer l'emploi du temps" src="../../../resources/images/aide/InsertEDT.png"/> et apr&egrave;s une derni&egrave;re confirmation.<br/>Le traitement peut &ecirc;tre long et il est lanc&eacute; en t&acirc;che de fond. Il est ainsi possible de travailler sur le cahier de texte durant l'op&eacute;ration.</p><p>Lorsque le traitement est termin&eacute;, un message le signale :<br/><img style="width: 100%; border: 1px solid" title="Fin de l'insertion" alt="Fin de l'insertion" src="../../../resources/images/aide/FinInsertEDT.png"/></p><p>Il est possible d'importer un autre emploi du temps, mais avec une date de d&eacute;but diff&eacute;rente, en r&eacute;p&eacute;tant les op&eacute;rations d&eacute;crites ci-dessus.</p><span style="font-weight:bold; vertical-align: bottom;">Remplacement d'un emploi du temps</span><p>Pour diff&eacute;rentes raisons, il peut &ecirc;tre n&eacute;cessaire d'importer un nouvel emploi du temps qui viendra remplacer un emploi du temps d&eacute;j&agrave; import&eacute; et qui d&eacute;bute &agrave; la m&ecirc;me date. Une fois la date choisie, si un emploi du temps existe d&eacute;j&agrave; dans le cahier de texte pour cette date, le message suivant est affich&eacute; :<br/><img style="width: 100%; border:1px solid;" title="Un emploi du temps existe d&eacute;j&agrave;" alt="Un emploi du temps existe d&eacute;j&agrave;" src="../../../resources/images/aide/AvertExisteEDT.png"/></p><p>Avant l'import du nouvel emploi du temps, il faut donc vider la totalit&eacute; de l'emploi du temps &agrave; l'aide du bouton <img style="width: 20px; vertical-align: baseline;" title="Supprimer l'emploi du temps" alt="Supprimer l'emploi du temps" src="../../../resources/images/aide/SupprimerEDT.png"/>.</p><span style="font-weight:bold; vertical-align: bottom;">Menu contextuel</span><p>Le menu contextuel pr&eacute;sente des boutons diff&eacute;rents suivant l'&eacute;tape &agrave; laquelle on se situe dans l'import :<div style="margin-left: 40px;"><img style="width: 20px; vertical-align: baseline;" title="R&eacute;initialiser le formulaire" alt="R&eacute;initialiser le formulaire" src="../../../resources/images/aide/Reinitialiser.png"/> : r&eacute;initialisation du formulaire de d&eacute;finition des fichiers &agrave; importer ;<br/><img style="width: 20px; vertical-align: baseline;" title="Importer les fichiers EDT" alt="Importer les fichiers EDT" src="../../../resources/images/aide/DebutImportEDT.png"/> : lancement du d&eacute;but de l'import des fichiers EDT ;<br/><img style="width: 20px; vertical-align: baseline;" title="Rapport de l'import des fichiers" alt="Rapport de l'import des fichiers" src="../../../resources/images/aide/Pdf.png"/> : consultation du rapport PDF de l'import des fichiers EDT ;<br/><img style="width: 20px; vertical-align: baseline;" title="Ins&eacute;rer l'emploi du temps" alt="Ins&eacute;rer l'emploi du temps" src="../../../resources/images/aide/InsertEDT.png"/> : insertion des informations EDT dans le cahier de texte ;<br/><img style="width: 20px; vertical-align: baseline;" title="Supprimer l'emploi du temps" alt="Supprimer l'emploi du temps" src="../../../resources/images/aide/SupprimerEDT.png"/> : suppression d'un emploi du temps dans le cahier de texte ;<br/><img style="width: 20px; vertical-align: baseline;" title="Aide en ligne" alt="Aide en ligne" src="../../../resources/images/aide/Aide.png" /> : aide en ligne de l'import EDT.</div><br/>

visaSeance.aide=<h1>Poser des visas sur des s&eacute;ances</h1><p><span style="font-weight:bold italic; vertical-align: bottom;">Les visas</span></p><p>2 sortes de visas peuvent &ecirc;tre pos&eacute;s sur un cahier de texte :</p><div style="margin-left: 40px;"><img style="width: 20px; vertical-align: baseline;" alt="Visa simple" title="Visa simple" src="../../../resources/images/icones/addVisaSimpleBig.png" /> : le <span style="font-weight:bold; vertical-align: bottom;">visa simple</span> indique que le cahier de texte s&eacute;lectionn&eacute; a &eacute;t&eacute; vis&eacute;. Avec ce visa simple, l'enseignant pourra modifier les s&eacute;ances vis&eacute;es sans que soit conserv&eacute; un historique de la séance ;<br/><img style="width: 20px; vertical-align: baseline;" alt="Visa m&eacute;mo" title="Visa m&eacute;mo" src="../../../resources/images/icones/addVisaMemoBig.png" /> : le <span style="font-weight:bold; vertical-align: bottom;">visa m&eacute;mo</span> indique que le cahier de texte s&eacute;lectionn&eacute; a &eacute;t&eacute; vis&eacute; et que les s&eacute;ances du cahier de texte seront conserv&eacute;es dans l'&eacute;tat dans lequel elles &eacute;taient au moment de la pose du visa. Avec ce visa m&eacute;mo, l'enseignant pourra modifier les s&eacute;ances vis&eacute;es, mais un historique de la s&eacute;ance au moment de la pose du visa sera conserv&eacute;. Ce visa est plus consommateur de ressources qu'un visa simple.</div><br/><span style="font-weight:bold; vertical-align: bottom;">Crit&egrave;res de recherche</span><br /><p>Les crit&egrave;res de recherche permettent de pr&eacute;ciser les cahiers de texte qui doivent &ecirc;tre vis&eacute;s. Pour cela il faut indiquer le nom de l'enseignant, le ou les enseignements souhait&eacute;s, une classe, un groupe ou toutes les classes et groupes de l'enseignant, une s&eacute;quence ou toutes les s&eacute;quences du cahier de texte de l'enseignant, et enfin l'&eacute;tat des s&eacute;ances vis à vis des visas.</p><p>Chaque fois q'un crit&egrave;re de recherche est modifi&eacute;, il faut cliquer sur le bouton <img title="Rechercher" style="width: 20px; vertical-align: baseline;" alt="Rechercher" src="../../../resources/images/icones/binocular.png" /> pour ex&eacute;cuter la recherche des s&eacute;ances concern&eacute;es.<br /></p><span style="font-weight:bold; vertical-align: bottom;">Affichage</span><br /><p>Le choix entre deux modes d'affichage est proposé : sous forme d'une liste (tableau synth&eacute;tique) ou sous forme d&eacute;taill&eacute;e.</p><br/><span style="font-weight:bold; vertical-align: bottom;">Menu contextuel</span><br /><p>Le menu contextuel propose les boutons suivants :</p><div style="margin-left: 40px;"><img style="width: 20px; vertical-align: baseline;" title="Enregistrer" alt="Enregistrer" src="../../../resources/images/icones/save.png" /> : enregistrer les visas pos&eacute;s ;<br /><img style="width: 20px; vertical-align: baseline;" title="Rechercher" alt="Rechercher" src="../../../resources/images/icones/binocular.png" />: lancer la recherche des s&eacute;ances ;<br /><img style="width: 20px; vertical-align: baseline;" alt="R&eacute;initialiser les crit&egrave;res de recherche" title="R&eacute;initialiser" src="../../../resources/images/icones/eraser.png" /> : r&eacute;initialiser les crit&egrave;res de recherche ;<br /><img style="width: 20px; vertical-align: baseline;" alt="Remplissage du cahier de texte" title="Remplissage CTN" src="../../../resources/images/icones/seanceRecherche.png" /> : voir le remplissage du cahier de texte de l'enseignant ;<br /><img style="width: 20px; vertical-align: baseline;" alt="Poser un visa simple" title="Visa simple" src="../../../resources/images/icones/addVisaSimpleBig.png" /> : poser un visa simple sur les s&eacute;ances ;<br /><img style="width: 20px; vertical-align: baseline;" alt="poser un visa m&eacute;mo" title="Visa m&eacute;mo" src="../../../resources/images/icones/addVisaMemoBig.png" /> : poser un visa m&eacute;mo sur les s&eacute;ances ;<br /><img style="width: 20px; vertical-align: baseline;" title="Aide en ligne" alt="Aide en ligne" src="../../../resources/images/icones/aide.png" /> : aide en ligne de la saisie de l'emploi du temps.<br /></div><br/><span style="font-weight:bold; vertical-align: bottom;">Affichage "liste"</span><p>Les s&eacute;ances sont tri&eacute;es par ordre chronologique sous forme d'un tableau qui pr&eacute;sente succinctement la s&eacute;ance, la date à laquelle elle a &eacute;t&eacute; modifi&eacute;e, la date du visa du chef d'&eacute;tablissement et la date du visa de l'inspection.<br/>Le symbole <img style="width: 20px; vertical-align: baseline;" title="Visa m&eacute;mo" alt="Visa m&eacute;mo" src="../../../resources/images/icones/lock.png" /> plac&eacute; &agrave; cot&eacute; de la date d'un visa indique qu'il s'agit d'un visa m&eacute;mo.<br/>Le bouton <img style="width: 20px; vertical-align: baseline;" title="Loupe" alt="D&eacute; de la s&eacute;ance" src="../../../resources/images/icones/aide-saisie.png" /> permet d'afficher le détail de la s&eacute;ance : contenu de la s&eacute;ance, travail &agrave; faire, pi&egrave;ces jointes et &eacute;ventuellement, si la s&eacute;ance a &eacute;t&eacute; modifi&eacute;e depuis le dernier visa m&eacute;mo, le contenu de la s&eacute;ance telle qu'il &eacute;tait au moment du visa.<br/>Un survol de la souris sur les cases "<span style="font-weight:italic; vertical-align: bottom;">Modif.</span>", "<span style="font-weight:italic; vertical-align: bottom;">Visa Dir</span>" et "<span style="font-weight:italic; vertical-align: bottom;">Visa Ins</span>" permet d'avoir des informations compl&eacute;mentaires.<br/>Les cases des visas on une couleur de fond rouge si la s&eacute;ance n'a pas encore &eacute;t&eacute; vis&eacute;e ou si la s&eacute;ance a &eacute;t&eacute; modifi&eacute;e par l'enseignant apr&egrave;s qu'un visa m&eacute;mo ait &eacute;t&eacute; pos&eacute;.</p><span style="font-weight:bold; vertical-align: bottom;">Affichage "D&eacute;tail"</span><p>Les s&eacute;ances sont affich&eacute;s par ordre chronologique.<br/>La barre de titre de chaque s&eacute;ance contient un certain nombre d'informations sur la s&eacute;ance : date et heure de la s&eacute;ance, classe ou groupe, intitul&eacute; de la s&eacute;quence &agrave; laquelle est rattach&eacute;e la s&eacute;ance.<br/>La couleur de la barre de titre correspond à une s&eacute;quence donn&eacute;e ; toutes les s&eacute;ances appartenant &agrave; une m&ecirc;me s&eacute;quence ont une barre de tire de la m&ecirc;me couleur.</p><p>Les s&eacute;ances qui ont &eacute;t&eacute; modifi&eacute;es depuis la pose d'un visa m&eacute;mo apparaissent avec un fond rouge et le bouton <img style="width: 20px; vertical-align: baseline;" title="Visa m&eacute;mo" alt="Visa m&eacute;mo" src="../../../resources/images/icones/lock.png" /> plac&eacute; &agrave; cot&eacute; permet d'acc&eacute;der au contenu de la s&eacute;ance tel qu'il &eacute;tait au moment du visa m&eacute;mo.</p><p>Les boutons <img style="width: 20px; vertical-align: baseline;" title="Loupe" alt="D&eacute; de la s&eacute;ance" src="../../../resources/images/icones/aide-saisie.png" /> permettent d'acc&eacute;der au d&eacute;tail d'un devoir ou d'un travail &agrave; faire.</p><p><br/></p>

visaListe.aide=<h1>Liste des enseignants - synth&egrave;se des visas</h1><p>Sur cet &eacute;cran, seuls les enseignants s'&eacute;tant connect&eacute;s au moins une fois au cahier de texte apparaissent.</p><p><span style="font-weight:bold; vertical-align: bottom;">Les visas</span></p><p>2 sortes de visas peuvent &ecirc;tre pos&eacute;s sur un cahier de texte :</p><div style="margin-left: 40px;"><img style="width: 20px; vertical-align: baseline;" alt="Visa simple" title="Visa simple" src="../../../resources/images/icones/addVisaSimple.png" /> : le <span style="font-weight:bold; vertical-align: bottom;">visa simple</span> indique que le cahier de texte s&eacute;lectionn&eacute; a &eacute;t&eacute; vis&eacute;. Avec ce visa simple, l'enseignant pourra modifier les s&eacute;ances vis&eacute;es sans que soit conserv&eacute; un historique de la séance ;<br/><img style="width: 20px; vertical-align: baseline;" alt="Visa m&eacute;mo" title="Visa m&eacute;mo" src="../../../resources/images/icones/addVisaMemo.png" /> : le <span style="font-weight:bold; vertical-align: bottom;">visa m&eacute;mo</span> indique que le cahier de texte s&eacute;lectionn&eacute; a &eacute;t&eacute; vis&eacute; et que les s&eacute;ances du cahier de texte seront conserv&eacute;es dans l'&eacute;tat dans lequel elles &eacute;taient au moment de la pose du visa. Avec ce visa m&eacute;mo, l'enseignant pourra modifier les s&eacute;ances vis&eacute;es, mais un historique de la s&eacute;ance au moment de la pose du visa sera conserv&eacute;. Ce visa est plus consommateur de ressources qu'un visa simple.</div><br /><span style="font-weight:bold; vertical-align: bottom;">Liste des enseignants</span><br /><p>La liste des enseignants propose une synth&egrave;se des visas pos&eacute;s sur les cahiers de texte des enseignants. Le tableau comporte 6 colonnes : nom et pr&eacute;nom de l'enseignant, date de dernier ajout d'informations dans un cahier de texte, type (chef d'&eacute;tablissement ou inspection) et date du dernier visa re&ccedil;u par l'enseignant, boutons des actions possibles qui concernent l'enseignant.<br/>Le tableau est tri&eacute; par ordre alphab&eacute;tique des noms des enseignants, mais en cliquant sur le nom d'une colonne, le tableau est tri&eacute; sur cette colonne. Un nouveau clic sur le nom de la colonne effectue le tri dans l'ordre inverse.</p><p>3 boutons sont disponibles face au nom d'un enseignant :<div style="margin-left: 40px;"><img style="width: 20px; vertical-align: baseline;" title="Remplissage du Cahier de texte" alt="Remplissage du Cahier de texte" src="../../../resources/images/icones/seanceRecherche.png" /> : permet de consulter, par semaine, le remplissage du cahier de texte d'un enseignant (les s&eacute;ances remplies sont color&eacute;es, les s&eacute;ances non remplies sont blanches avec un tour de couleur) ;<br/><img style="width: 20px; vertical-align: baseline;" alt="S&eacute;ces de l'enseignant" title="S&eacute;ces de l'enseignant" src="../../../resources/images/icones/aide-saisie.png" /> : permet de voir toutes les s&eacute;ances saisies par l'enseignant ;<br/><img style="width: 20px; vertical-align: baseline;" alt="Liste des cahiers de texte" title="Liste des cahiers de texte" src="../../../resources/images/icones/plus.png" /> : permet de lister les cahiers de texte de l'enseignant, ainsi que les visas qui y ont &eacute;t&eacute; pos&eacute;s.</div></p><br/><span style="font-weight:bold; vertical-align: bottom;">Liste des cahiers de texte d'un enseignant</span><br /><p>En cliquant sur le bouton <img style="width: 20px; vertical-align: baseline;" alt="Liste des cahiers de texte" title="Liste des cahiers de texte" src="../../../resources/images/icones/plus.png" /> associ&eacute; &agrave; un enseignant, la liste des ses cahiers de texte s'affiche sur 6 colonnes : classe ou groupe, enseignement dispens&eacute;, date du dernier ajout d'information dans le cahier de texte, dernier visa pos&eacute; (chef d'&eacute;tablissement ou inspection) sur le cahier de texte, date de ce visa, actions possibles sur le cahier de texte.<br/>Si un cahier de texte a re&ccedil;u un visa chef d'&eacute;tablissement et un visa inspection, alors 2 lignes sont affich&eacute;es pour le cahier de texte.<br/>Le cadenas plac&eacute; &agrave; cot&eacute; du visa indique qu'il s'agit d'un visa m&eacute;mo.<br/>Si une s&eacute;ance du cahier de texte a &eacute;t&eacute; modifi&eacute;e apr&egrave;s la pose d'un visa, la date de dernier ajout s'affiche en rouge dans le tableau.</p><p>Les boutons action de la liste des cahiers de texte d'un enseignant permettent :<div style="margin-left: 40px;"><img style="width: 20px; vertical-align: baseline;" alt="Visa simple" title="Visa simple" src="../../../resources/images/icones/addVisaSimple.png" /> : la pose d'un visa simple ;<br/><img style="width: 20px; vertical-align: baseline;" alt="Visa m&eacute;mo" title="Visa m&eacute;mo" src="../../../resources/images/icones/addVisaMemo.png" /> : la pose d'un visa m&eacute;mo ;<br/><img style="width: 20px; vertical-align: baseline;" alt="Supprimer visa" title="Supprimer visa" src="../../../resources/images/icones/delVisa.png" /> : le retrait du visa d&eacute;j&agrave; pos&eacute ;<br/><img style="width: 20px; vertical-align: baseline;" alt="S&eacute;ances du cahier de texte" title="S&eacute;ances du cahier de texte" src="../../../resources/images/icones/aide-saisie.png" /> : l'acc&egrave;s aux s&eacute;ances du cahier de texte.</div><br/>Le bouton <img style="width: 20px; vertical-align: baseline;" alt="Replier liste des cahiers de texte" title="Replier liste des cahiers de texte" src="../../../resources/images/icones/minus.png" /> permet de refermer la liste des cahiers de texte d'un enseignant.</p><br/><span style="font-weight:bold; vertical-align: bottom;">Menu contextuel</span><br /><p>Le menu contextuel propose les boutons suivants :</p><div style="margin-left: 40px;">    <img style="width: 20px; vertical-align: baseline;" title="Enregistrer" alt="Enregistrer" src="../../../resources/images/icones/save.png" /> : enregistrer les visas pos&eacute;s depuis cet écran ;<br /><img style="width: 20px; vertical-align: baseline;" title="Annuler" alt="Annuler" src="../../../resources/images/icones/annuler.png" />: Annuler les visas pos&eacute; depuis le dernier enregistrement.<br /></div><br/>
